code-review/NRB_3471_3546/База_Было/Documents/ФормированиеОтчетаВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФормированиеОтчетаВыписки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий350</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>Ценная бумага</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ФормированиеОтчетаВыписки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СчетДепоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура("Владелец", Объект.Депонент);
	мПараметры = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.СчетаДепо.ФормаВыбора", мПараметры, Элементы.СчетДепо);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Депонент) И Объект.Депонент.Субброкер Тогда
		ДобавитьКомандуОтправкиОтчетаПоСчетуДепо();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандуОтправкиОтчетаПоСчетуДепо()
	
	ИмяКнопки = "ОтправитьОтчетПоСчетуДепоВФорматеXLS";
	КомандаФормы = Команды.Добавить(ИмяКнопки);
	КомандаФормы.Действие = ИмяКнопки;
	
	КнопкаОтправки = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), КоманднаяПанель);
	КнопкаОтправки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаОтправки.Заголовок = "Отправить отчет по счету депо";
	КнопкаОтправки.ИмяКоманды = ИмяКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчетПоСчетуДепоВФорматеXLS()
	
	ОтправитьОтчетПоСчетуСубброкераВФорматеXLSНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетПоСчетуСубброкераВФорматеXLSНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Поручения = Новый ТаблицаЗначений;
		Поручения.Колонки.Добавить("Поручение", Новый ОписаниеТипов("ДокументСсылка.Поручение"));
		Поручения.Колонки.Добавить("ВнешнийИсточникДляРСВПоСубклиентам", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВнешниеИсточники"));
		
		Строка = Поручения.Добавить();
		Строка.Поручение = Объект.ДокументОснование;
		Строка.ВнешнийИсточникДляРСВПоСубклиентам = Объект.Депонент.ВнешнийИсточникДляРСВПоСубклиентам;
				
		РегламентныеЗаданияСервер.СформироватьИОтправитьОтчеты(Поручения, НачалоДня(Объект.ДокументОснование.ДатаКонПериода));
		
	КонецЕсли;
	
КонецПроцедуры
